# Data frames

# data frames used for multidimensional data we can make data frames by combining two series like Series+series=dataframe

In [1]:
import pandas as pd

In [2]:
apples=pd.Series([3,2,0,1])

In [3]:
oranges=pd.Series([3,2,0,1])

In [4]:
print(apples,oranges)

0    3
1    2
2    0
3    1
dtype: int64 0    3
1    2
2    0
3    1
dtype: int64

In [5]:
data={"apples":apples,"oranges":oranges}

In [6]:
fruits_df=pd.DataFrame(data)

In [7]:
fruits_df

   apples  oranges
0       3        3
1       2        2
2       0        0
3       1        1

In [8]:
#lets have another example

In [9]:
Dict={
    "students":["Farhan","Daud","Minhal","Usama","hafiz"],
    "Ag":[6562,6529,6505,6521,6524],
    "cgpa":[2.8,3.0,3.2,2.8,3.9] 
    
}

In [10]:
frame=pd.DataFrame(Dict)

In [11]:
frame

  students    Ag  cgpa
0   Farhan  6562   2.8
1     Daud  6529   3.0
2   Minhal  6505   3.2
3    Usama  6521   2.8
4    hafiz  6524   3.9

In [12]:
#we can also use like this

In [13]:
frame=pd.DataFrame(Dict,index=["1st","2nd","3rd","4rth","5fth"])

In [14]:
frame

     students    Ag  cgpa
1st    Farhan  6562   2.8
2nd      Daud  6529   3.0
3rd    Minhal  6505   3.2
4rth    Usama  6521   2.8
5fth    hafiz  6524   3.9

In [15]:
frame=pd.DataFrame(Dict,columns=["cgpa","Ag","students"])

In [16]:
frame.head()

   cgpa    Ag students
0   2.8  6562   Farhan
1   3.0  6529     Daud
2   3.2  6505   Minhal
3   2.8  6521    Usama
4   3.9  6524    hafiz

In [17]:
#another example

In [18]:
dict2={"students name":["farhan","daud","usama","hafiz","abdullah","subhan"],
       "Id":[10,7,8,9,5,3],
       "dpt":["cs","cs","cs","cs","cs","cs"],
       "cgpa":[2.9,4.0,3.8,2.5,2.4,3.0]
      
      
      }

In [19]:
frame2=pd.DataFrame(dict2,columns=["Id","students name","dpt","cgpa","major"],index=["one","two","three","four","five","six"])

In [20]:
frame2

       Id students name dpt  cgpa major
one    10        farhan  cs   2.9   NaN
two     7          daud  cs   4.0   NaN
three   8         usama  cs   3.8   NaN
four    9         hafiz  cs   2.5   NaN
five    5      abdullah  cs   2.4   NaN
six     3        subhan  cs   3.0   NaN

In [21]:
frame2.head()

       Id students name dpt  cgpa major
one    10        farhan  cs   2.9   NaN
two     7          daud  cs   4.0   NaN
three   8         usama  cs   3.8   NaN
four    9         hafiz  cs   2.5   NaN
five    5      abdullah  cs   2.4   NaN

In [22]:
frame2.columns

Index(['Id', 'students name', 'dpt', 'cgpa', 'major'], dtype='object')

# How to access data from data frames

In [23]:
#this is dictionary like notation to extract data

In [24]:
dict2["cgpa"]

[2.9, 4.0, 3.8, 2.5, 2.4, 3.0]

In [25]:
dict2["dpt"]

['cs', 'cs', 'cs', 'cs', 'cs', 'cs']

In [26]:
# another way to access data

In [27]:
frame2.dpt

one      cs
two      cs
three    cs
four     cs
five     cs
six      cs
Name: dpt, dtype: object

In [28]:
frame2.Id

one      10
two       7
three     8
four      9
five      5
six       3
Name: Id, dtype: int64

In [29]:
#it will tell us the info whose present in the 1th index
frame2.loc["one"]

Id                   10
students name    farhan
dpt                  cs
cgpa                2.9
major               NaN
Name: one, dtype: object

In [30]:
frame2

       Id students name dpt  cgpa major
one    10        farhan  cs   2.9   NaN
two     7          daud  cs   4.0   NaN
three   8         usama  cs   3.8   NaN
four    9         hafiz  cs   2.5   NaN
five    5      abdullah  cs   2.4   NaN
six     3        subhan  cs   3.0   NaN

In [31]:
import numpy as np

In [32]:
ln=len(frame2)

In [33]:
rng=np.arange(ln)

In [34]:
rng

array([0, 1, 2, 3, 4, 5])

In [35]:
frame2["major"]=rng

In [36]:
frame2

       Id students name dpt  cgpa  major
one    10        farhan  cs   2.9      0
two     7          daud  cs   4.0      1
three   8         usama  cs   3.8      2
four    9         hafiz  cs   2.5      3
five    5      abdullah  cs   2.4      4
six     3        subhan  cs   3.0      5

In [37]:
dict2

{'students name': ['farhan', 'daud', 'usama', 'hafiz', 'abdullah', 'subhan'],
 'Id': [10, 7, 8, 9, 5, 3],
 'dpt': ['cs', 'cs', 'cs', 'cs', 'cs', 'cs'],
 'cgpa': [2.9, 4.0, 3.8, 2.5, 2.4, 3.0]}

In [38]:
frame2

       Id students name dpt  cgpa  major
one    10        farhan  cs   2.9      0
two     7          daud  cs   4.0      1
three   8         usama  cs   3.8      2
four    9         hafiz  cs   2.5      3
five    5      abdullah  cs   2.4      4
six     3        subhan  cs   3.0      5

In [39]:
frame2.head()

       Id students name dpt  cgpa  major
one    10        farhan  cs   2.9      0
two     7          daud  cs   4.0      1
three   8         usama  cs   3.8      2
four    9         hafiz  cs   2.5      3
five    5      abdullah  cs   2.4      4

In [44]:
frame.index

RangeIndex(start=0, stop=5, step=1)

In [47]:
frame.students name

SyntaxError: invalid syntax (Temp/ipykernel_13560/3881454067.py, line 1)